#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/FIAP-Lanchonete-G41/lambda-authorizer/runs/run-XgTQEckdf1wfCN1p

Waiting for the plan to start...

Terraform v1.10.2
on linux_amd64
Initializing plugins and modules...
data.aws_apigatewayv2_api.api_gateway: Refreshing...
data.aws_iam_role.lab_role: Refreshing...
data.aws_iam_role.lab_role: Refresh complete after 0s [id=LabRole]
aws_lambda_function.authorizer: Refreshing state... [id=cognito-authorizer]
data.aws_apigatewayv2_api.api_gateway: Refresh complete after 0s [id=yvq96tymqj]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_apigatewayv2_authorizer.lambda_authorizer will be created
  + resource "aws_apigatewayv2_authorizer" "lambda_authorizer" {
      + api_id                            = "yvq96tymqj"
      + authorizer_payload_format_version = "2.0"
      + authorizer_result_ttl_in_seconds  = (known after apply)
      + authorizer_type                   = "REQUEST"
      + authorizer_uri                    = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:721525683170:function:cognito-authorizer/invocations"
      + id                                = (known after apply)
      + identity_sources                  = [
          + "$request.header.Authorization",
        ]
      + name                              = "lambda-authorizer"
    }

  # aws_lambda_function.authorizer will be updated in-place
  ~ resource "aws_lambda_function" "authorizer" {
        id                             = "cognito-authorizer"
      ~ last_modified                  = "2024-12-16T01:06:39.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:721525683170:function:cognito-authorizer:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:721525683170:function:cognito-authorizer:5/invocations" -> (known after apply)
      ~ source_code_hash               = "3l9Uy00/Gvgmm6Mrlll0tKiKo1qtrAS5AzexQk3lFaA=" -> "mqrofu/0PisLkAbdYHnD+dmJXWlk6BaU00K3K5ap/5A="
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rafaelvmasc, Action: `pull_request`*